stko/oobd/interface/Designs/CORTEX/STM32F103C8_Eclipse_GCC/D2/app/src/SystemConfig.c
/*

 This file is part of the OOBD.org distribution.

 OOBD.org is free software; you can redistribute it and/or modify it
 under the terms of the GNU General Public License (version 2) as published
 by the Free Software Foundation and modified by the FreeRTOS exception.

 OOBD.org is distributed in the hope that it will be useful, but WITHOUT
 ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for
 more details.

 You should have received a copy of the GNU General Public License along
 with FreeRTOS.org; if not, write to the Free Software Foundation, Inc., 59
 Temple Place, Suite 330, Boston, MA  02111-1307  USA.


 OOBD C source files requirement:
 Unix EOL file format
 UTF-8
 formated with "indent -kr"

 Please ensure to read the configuration and relevant port sections of the
 online documentation.


 OOBD is using FreeRTOS (www.FreeRTOS.org)

 */

/* Includes ------------------------------------------------------------------*/
#include "FreeRTOSConfig.h"
#include "SystemConfig.h"
#include "stm32f10x.h"
#include "od_config.h"
#include "mc_serial.h"
#include "odp_uds.h"
#include "odb_can.h"

/* -------- Used Global variables --------------------------------------------*/

uint8_t BTM222_BtAddress[18] = "00:00:00:00:00:00";

uint8_t BTM222_DeviceName[17] = "not detected";

unsigned char BTM222_UartSpeed;

/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
DMA_InitTypeDef sEEDMA_InitStructure;

/* Private function prototypes -----------------------------------------------*/

/* Private functions ---------------------------------------------------------*/

/**
 * @brief  Configures the system.
 * @param None.
 * @retval : None.
 */
void System_Configuration(void)
{

    /* GPIO configuration */
    GPIO_Configuration();

    /* USART1 configuration */
    USART1_Configuration();

    /* USART1 configuration */
    USART2_Configuration();

    /* USART1 configuration */
    CAN1_Configuration(VALUE_BUS_CONFIG_11bit_500kbit, CAN_Mode_Silent);	/* default initialization */

    /* Analog digitial converter configuration */
    ADC_Configuration();

    /* Timer 2 configuration for PWM output, 3100Hz/50% duty cycle */
    TIM2_Configuration(3100);	/* OOBD-Cup v5 only * */

    /* NVIC configuration */
    //  NVIC_Configuration();

    // move to hardware init function as well as LEDTask
    //xQueueCreate = xQueueCreate (2, sizeof (boolean));
    extern xQueueHandle Led1Queue;

    extern xQueueHandle Led2Queue;

}

/*----------------------------------------------------------------------------*/
/**
 * @brief  Configure the nested vectored interrupt controller
 * @param  None
 * @retval None
 */
void NVIC_Configuration(void)
{

    NVIC_InitTypeDef NVIC_InitStructure;

    /* Set the Vector Table base location at 0x2400 */
    NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x2400);

    /* Setting the priority grouping bits length */
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);

    /* Enable the USART1 Interrupt */
    NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;

    /* NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0; */
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority
	= (configMAX_SYSCALL_INTERRUPT_PRIORITY >> 4) + 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    /* Enable CAN1 interrupt */
    NVIC_InitStructure.NVIC_IRQChannel = USB_LP_CAN1_RX0_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority
	= (configMAX_SYSCALL_INTERRUPT_PRIORITY >> 4) + 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    NVIC_InitStructure.NVIC_IRQChannel = I2C1_EV_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    NVIC_InitStructure.NVIC_IRQChannel = I2C1_ER_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
}

/*----------------------------------------------------------------------------*/
/**
 * @brief  returns peripherals hardware ID
 * @param  None
 * @retval 0 = standard DXM, 1 OOBD D2-V6
 */ 
portBASE_TYPE GPIO_HardwareLevel(void)
{
	uint8_t HardwareVariant;
	
    if  (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8) &&
		GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_13) &&
		GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_14) &&
		GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_14))
			HardwareVariant = 1; /* DXM1 */
	else if  (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8) &&
		GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_13) &&
		GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_14) &&
		!GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_14))
			HardwareVariant = 2; /* reserved for OOBD-Cup v5 subvariant */
	else if  (!GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8) &&
		GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_13) &&
		GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_14) &&
		GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_14))
			HardwareVariant = 3; /* reserved for OOBD-Cup v5 subvariant */
	else if  (!GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8) &&
		GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_13) &&
		GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_14) &&
		!GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_14))
			HardwareVariant = 4; /* OOBD-Cup v5 */
	else if  (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8) &&
		GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_13) &&
		!GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_14))
			HardwareVariant = 5; /* OOBD CAN Invader */
	else if  (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8) &&
		!GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_13) &&
		GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_14))
			HardwareVariant = 6; /* reserved for OOBD CAN Invader subvariant */
	else if  (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8) &&
		!GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_13) &&
		!GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_14))
			HardwareVariant = 7; /* reserved for OOBD CAN Invader subvariant */
	else
		HardwareVariant = 0;  /* default 0 = no valid hardware detected */
	
	return HardwareVariant;
}

